# 白色系 : 1
# 黑色系 : 2
# 灰色系 : 3
# 棕色系 : 4
# 米色系 : 5
# 綠色系 : 6
# 藍色系 : 7
# 紫色系 : 8
# 黃色系 : 9
# 粉色系 : 10
# 紅色系 : 11
# 橘色系 : 12
# 銀色系 : 13
# 金色系 : 14
# 其他 : 15
# {'M': 'MEN', 'W': 'WOMEN'}
# {'襯衫・罩衫': '10', 'T恤・剪裁上衣': '12', '上衣': '14', '外套': '16', '短夾克': '18', '大衣': '20', '褲子': '24', '裙子': '26', '洋裝': '28'}

{
    ("現代簡約風", "M", "黑色系"):["白色系", "灰色系", "鋼鐵藍", "銀色系"], # 主色：黑色（#000000）, 可搭配顏色：白色（#FFFFFF）、灰色（#A9A9A9）、鋼鐵藍（#4682B4）、銀色（#C0C0C0）
    ("現代簡約風", "W", "白色系"):["黑色系", "灰色系", "鋼鐵藍", "柔和灰"], # 主色：白色（#FFFFFF）, 可搭配顏色：黑色（#000000）、灰色（#A9A9A9）、鋼鐵藍（#4682B4）、柔和灰（#D3D3D3）

    ("工業風", "M", "深灰色"):["黑色系", "鐵銹紅", "銀色", "鐵灰色"],
    ("工業風", "W", "黑色"):["深灰色", "鐵銹紅", "銀色", "灰藍色"],


    ("復古風情", "M", "深褐色"):["米色", "橄欖綠", "紅棕色", "黃褐色"],
    ("復古風情", "W", "米色"):["深褐色", "橄欖綠", "紅棕色", "金棕色"],


    ("極簡北歐風", "M", "米白色"):["淺灰色", "黑色", "白色", "淺藍色"],
    ("極簡北歐風", "W", "淺灰色"):["米白色", "黑色", "白色", "淺藍色"],


    ("日式庭園風", "M", "苔綠色"):["米色", "棕色", "淺灰色", "象牙白"],
    ("日式庭園風", "W", "米色"):["棕色", "苔綠色", "象牙白", "灰藍色"],

    ("波西米亞風", "M", "燈籠紅"):["深藍色", "米色", "橄欖綠", "棕色"],
    ("波西米亞風", "W", "番茄紅"):["深藍色", "米色", "橄欖綠", "棕色"],

    ("舒適鄉村風", "M", "卡其色"):["棕色", "深綠色", "米色", "白色"],
    ("舒適鄉村風", "W", "卡其色"):["棕色", "深綠色", "米色", "白色"],

    ("海洋風／地中海楓", "M", "海藍色"):["白色", "淺綠色", "米色", "沙色"],
    ("海洋風／地中海楓", "W", "白色"):["海藍色", "深綠色", "米色", "沙色"],

    ("東方禪風", "M", "淺灰色"):["米色", "棕色", "深綠色", "象牙白"],
    ("東方禪風", "W", "米色"):["淺灰色", "棕色", "深綠色", "象牙白"],
    
}
